Revit 2027 API
ExportDWGSettings.FindByName Method
 Returns the pre-defined non-in-session exporting settings for DWG in the given document with the specified name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExportDWGSettings FindByName(
	Document aDoc,
	string name
)
Public Shared Function FindByName (
	aDoc As Document,
	name As String
) As ExportDWGSettings
public:
static ExportDWGSettings^ FindByName(
	Document^ aDoc,
	String^ name
)
static member FindByName :
        aDoc : Document *
        name : string -> ExportDWGSettings
Parameters
aDoc Document
 A Revit document to retrieve the specified pre-defined exporting settings for DWG.
name String
 The name of the settings to retrieve.
Return Value
ExportDWGSettings
 The pre-defined DWG exporting settings, or null if nothing found that has the corresponding name.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportDWGSettings Class
Autodesk.Revit.DB Namespace